Revit 2027 API
ParameterTypeId.RbsCurvetypeDefaultMechjointParam Property
 "Flange"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsCurvetypeDefaultMechjointParam { get; }
Public Shared ReadOnly Property RbsCurvetypeDefaultMechjointParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsCurvetypeDefaultMechjointParam {
	ForgeTypeId^ get ();
}
static member RbsCurvetypeDefaultMechjointParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace